import React from "react";
import styles from "./style.css";

interface KUTableRowProps {
    data?: string[][];
}

export const KUTable: React.FC<KUTableRowProps> = ({ data }) => {
    return (
        <table className={styles.contentTable}>
            <thead>
                <tr>
                    <th>
                        Редни
                        <br />
                        број
                    </th>
                    <th>
                        КУ
                        <br />
                        Број
                    </th>
                    <th>
                        Датум
                        <br />
                        пријаве
                    </th>
                    <th>
                        Достављено
                        <br />
                        ВТЈ
                    </th>
                    <th>Пријављени</th>
                    <th>
                        Кривично <br />
                        дело (члан)
                    </th>
                    <th>
                        Задужен <br />
                        радник
                    </th>
                    <th>
                        Достављено <br />
                        ВЈТ
                    </th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <div className={styles.scrollView}>
                            <ul>
                                <li>Пера Петровић</li>
                                <li>Пера Петровић</li>
                                <li>Пера Петровић</li>
                                <li>Пера Петровић</li>
                                <li>Пера Петровић</li>
                                <li>Пера Петровић</li>
                            </ul>
                        </div>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
                <tr>
                    <th>54343243</th>
                    <th>54343243</th>
                    <th>24/09/2002</th>
                    <th>ДА</th>
                    <th>
                        <ul>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                            <li>Пера Петровић</li>
                        </ul>
                    </th>
                    <th>Кривично дело то и то по закону том и том члана 5</th>
                    <th>Маја Миловић</th>
                    <th>Да</th>
                </tr>
            </tbody>
        </table>
    );
};
